DataProcessors/АР17_ЖурналНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР17_ЖурналНачислений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановленВыбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Акты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/АР_ВидыОперацийСчетНаАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_ВидыОперацийСчетНаАренду</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР17_ПроведениеДоговораАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_ПроведениеДоговораАренды</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_УслугиПоАренде</xr:Item>
				<xr:Item>AccumulationRegister.АР_РасчетыПоДоговорам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документоснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАренды</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АР17_ЖурналНачислений/Forms/Форма/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	АР_ОбщиеПроцедурыКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода); //-са
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);

	Если Не ЗначениеЗаполнено(Объект.ВидПериода) Тогда
		Объект.ВидПериода = АР_ОбщиеПроцедуры.ПолучитьВидПериодаПоПериодичности(Константы.АР_ПериодНачисленияАренднойПлаты.Получить());
	КонецЕсли;
	
	//ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"),
	//	Элементы.ВидПериода.СписокВыбора, Объект.ВидПериода);

	Объект.НачалоПериода = НачалоДня(НачалоМесяца(ТекущаяДата()));
	Объект.ОкончаниеПериода = КонецДня(КонецМесяца(ТекущаяДата()));
	Период = Формат(ТекущаяДата(),"ДФ='ММММ гггг'");
	//ЗаполнитьДоговора();
	
КонецПроцедуры

Процедура ЗаполнитьДоговора()
	
	Объект.Договора.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АР17_ЗаключениеДоговораАренды.Ссылка КАК ДоговорАренды
		|ПОМЕСТИТЬ ДоговорыАренды
		|ИЗ
		|	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
		|ГДЕ
		|	АР17_ЗаключениеДоговораАренды.Проведен
		|	И АР17_ЗаключениеДоговораАренды.Организация = &Организация
		|	И АР17_ЗаключениеДоговораАренды.ИК = &ИК
		|	И АР17_ЗаключениеДоговораАренды.ВидДоговора = &ВидДоговора
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыАренды.ДоговорАренды КАК ДоговорАренды,
		|	СУММА(АР17_ПроведениеДоговораАренды.СуммаПоДоговору) КАК СуммаПоДоговору
		|ПОМЕСТИТЬ ДоговорыИСуммы
		|ИЗ
		|	ДоговорыАренды КАК ДоговорыАренды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ПроведениеДоговораАренды КАК АР17_ПроведениеДоговораАренды
		|		ПО ДоговорыАренды.ДоговорАренды = АР17_ПроведениеДоговораАренды.ДоговорАренды
		|ГДЕ
		|	АР17_ПроведениеДоговораАренды.Дата >= &ДатаН
		|	И АР17_ПроведениеДоговораАренды.Дата <= &ДатаК
		|	И АР17_ПроведениеДоговораАренды.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыАренды.ДоговорАренды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыИСуммы.СуммаПоДоговору КАК СуммаПоДоговору,
		|	ДоговорыИСуммы.ДоговорАренды.Организация КАК Организация,
		|	ДоговорыИСуммы.ДоговорАренды.Контрагент КАК Контрагент,
		|	ДоговорыИСуммы.ДоговорАренды.ВидДоговора КАК ВидДоговора,
		|	ДоговорыИСуммы.ДоговорАренды.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДоговорыИСуммы.ДоговорАренды.Ссылка КАК Договор,
		|	ДоговорыИСуммы.ДоговорАренды.Номер КАК Номер,
		|	ДоговорыИСуммы.ДоговорАренды.Дата КАК Дата,
		|	ДоговорыИСуммы.ДоговорАренды.ИК КАК ИмущественныйКомплекс
		|ИЗ
		|	ДоговорыИСуммы КАК ДоговорыИСуммы";
	
	Если ЗначениеЗаполнено(Объект.ИК) Тогда
		Запрос.УстановитьПараметр("ИК", Объект.ИК);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И АР17_ЗаключениеДоговораАренды.ИК = &ИК", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		Запрос.УстановитьПараметр("ВидДоговора", Объект.ВидДоговора);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И АР17_ЗаключениеДоговораАренды.ВидДоговора = &ВидДоговора", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И АР17_ЗаключениеДоговораАренды.Организация = &Организация", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаН", НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаК", КонецДня(Объект.ОкончаниеПериода));
			   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		стр = Объект.Договора.Добавить();
		Стр.Контрагент = Выборка.Контрагент;
		Стр.Договор = Выборка.Договор;//Выборка.Ссылка;
		Стр.ВидДоговора = Выборка.ВидДоговора;
		Стр.Организация = Выборка.Организация;
		Стр.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		// счета
		ТЗСчета = ПолучитьСчета(Выборка.ДоговорКонтрагента, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.ОкончаниеПериода));
		Стр.КолСчетов = ТЗСчета.Количество();
		//-
		Если Стр.КолСчетов >= 1 Тогда 
			Стр.КолСчетовК = 1;
		ИначеЕсли Стр.КолСчетов = 0 
			Тогда
			Стр.КолСчетовК = 0;
		КонецЕсли;
		//+
		СуммаДоговора = 0;
		//Для Каждого СтрС Из ТЗСчета Цикл
		//	СуммаДоговора = СуммаДоговора + СтрС.Ссылка.Состав.Итог("СуммаПоДоговору");
		//КонецЦикла;
		СуммаДоговора = Выборка.СуммаПоДоговору;
		Если ТЗСчета.Количество() > 0 Тогда
			ТЗСчета.Свернуть("ДоговорКонтрагента","СуммаДокумента");
			Стр.СуммаСчетов = ТЗСчета[0].СуммаДокумента;
		КонецЕсли;
		Если СуммаДоговора <> Стр.СуммаСчетов Тогда
			Стр.КолСчетовК = 0;
		КонецЕсли;	
		// акты
		ТЗАкты = ПолучитьАкты(Выборка.ДоговорКонтрагента, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.ОкончаниеПериода));
		Стр.КолАктов = ТЗАкты.Количество();
		//-
		Если Стр.КолАктов >= 1 Тогда 
			Стр.КолАктовК = 1;
		ИначеЕсли Стр.КолАктов = 0 
			Тогда
			Стр.КолАктовК = 0;
		КонецЕсли;	
		//+
		//СуммаДоговора = 0;
		//Для Каждого СтрА Из ТЗАкты Цикл
		//	СуммаДоговора = СуммаДоговора + СтрА.Ссылка.Состав.Итог("СуммаПоДоговору");
		//КонецЦикла;	
		Если ТЗАкты.Количество() > 0 Тогда
			ТЗАкты.Свернуть("ДоговорКонтрагента","СуммаДокумента");
			Стр.СуммаАктов = ТЗАкты[0].СуммаДокумента;
		КонецЕсли;
		Если СуммаДоговора <> Стр.СуммаАктов Тогда
			Стр.КолАктовК = 0;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// + Рогачев  Андрей от 15.08.2016  № 109181
	Если  Элемент.ТекущийЭлемент.Имя="ДоговораДоговорНомер" Тогда
		Если СокрЛП(Элемент.ТекущиеДанные.Договор)<>"" Тогда
			Попытка
				//Элемент.ТекущиеДанные.Договор.ПолучитьФорму().Открыть();
				ПоказатьЗначение(,Элемент.ТекущиеДанные.Договор);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	// - Рогачев  Андрей от 15.08.2016  № 109181
	
	Попытка
		Элемент.ТекущиеДанные[Элемент.ТекущийЭлемент.Имя].ПолучитьФорму().Открыть();
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ДоговораПриАктивизацииСтроки(Элемент)
	
	Объект.Счета.Очистить();
	Объект.Акты.Очистить();
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ДанныеСтрокиТаблицы = Новый Структура("ДоговорКонтрагента");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, Элемент.ТекущиеДанные); 
		ДоговораПриАктивизацииСтрокиНаСервере(ДанныеСтрокиТаблицы);
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ДоговораПриАктивизацииСтрокиНаСервере(СтрокаТаблицы)
	
	ТЗСчета = ПолучитьСчета(СтрокаТаблицы.ДоговорКонтрагента, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.ОкончаниеПериода));
	Для Каждого СтрТЗ Из ТЗСчета Цикл	
		стр = Объект.Счета.Добавить();
		Стр.Ссылка = СтрТЗ.Ссылка;
		Стр.Номер = СтрТЗ.Номер;
		Стр.Дата = СтрТЗ.Дата;
		Стр.Контрагент = СтрТЗ.Контрагент;
		Стр.Сумма = СтрТЗ.СуммаДокумента;
	КонецЦикла;
	
	//////////////////////////////////////////////////////////
	
	ТЗАкты = ПолучитьАкты(СтрокаТаблицы.ДоговорКонтрагента, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.ОкончаниеПериода));
	Для Каждого СтрТЗ Из ТЗАкты Цикл	
		стр = Объект.Акты.Добавить();
		Стр.Ссылка = СтрТЗ.Ссылка;
		Стр.Номер = СтрТЗ.Номер;
		Стр.Дата = СтрТЗ.Дата;
		Стр.Контрагент = СтрТЗ.Контрагент;
		Стр.Сумма = СтрТЗ.СуммаДокумента;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСчета(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода)
	
	ЗапросСчета = Новый Запрос;
	ЗапросСчета.Текст = "ВЫБРАТЬ
	                    |	АР_СчетНаАренду.Ссылка,
	                    |	АР_СчетНаАренду.Номер,
	                    |	АР_СчетНаАренду.Дата,
	                    |	АР_СчетНаАренду.Контрагент,
	                    |	АР_СчетНаАренду.СуммаДокумента,
	                    |	АР_СчетНаАренду.ДоговорКонтрагента
	                    |ИЗ
	                    |	Документ.АР17_СчетНаАренду КАК АР_СчетНаАренду
	                    |ГДЕ
	                    |	АР_СчетНаАренду.ДоговорКонтрагента = &ДоговорКонтрагента
	                    |	И АР_СчетНаАренду.НачалоПериода <= &КонПериода
	                    |	И АР_СчетНаАренду.ОкончаниеПериода >= &НачПериода
	                    |	И АР_СчетНаАренду.ПометкаУдаления = ЛОЖЬ
	                    |	И АР_СчетНаАренду.ВидОперации <> Значение(Перечисление.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита)";
					   
					   
	ЗапросСчета.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	ЗапросСчета.УстановитьПараметр("НачПериода", НачалоПериода);
	ЗапросСчета.УстановитьПараметр("КонПериода", ОкончаниеПериода);
	
	Возврат ЗапросСчета.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПолучитьАкты(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода)
	
	ЗапросАкты = Новый Запрос;
	ЗапросАкты.Текст = "ВЫБРАТЬ
	                   |	АР_НачислениеАренднойПлаты.Ссылка,
	                   |	АР_НачислениеАренднойПлаты.Номер,
	                   |	АР_НачислениеАренднойПлаты.Дата,
	                   |	АР_НачислениеАренднойПлаты.Контрагент КАК Контрагент,
	                   |	АР_НачислениеАренднойПлаты.ДоговорКонтрагента,
	                   |	АР_НачислениеАренднойПлаты.СуммаДокумента
	                   |ИЗ
	                   |	Документ.АР17_НачислениеАренднойПлаты КАК АР_НачислениеАренднойПлаты
	                   |ГДЕ
	                   |	АР_НачислениеАренднойПлаты.ДоговорКонтрагента = &ДоговорКонтрагента
	                   |	И АР_НачислениеАренднойПлаты.НачалоПериода <= &КонПериода
	                   |	И АР_НачислениеАренднойПлаты.ОкончаниеПериода >= &НачПериода
	                   |	И НЕ АР_НачислениеАренднойПлаты.ПометкаУдаления";
				   
						
	ЗапросАкты.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	ЗапросАкты.УстановитьПараметр("НачПериода", НачалоПериода);
	ЗапросАкты.УстановитьПараметр("КонПериода", ОкончаниеПериода);
	
	Возврат ЗапросАкты.Выполнить().Выгрузить();
	
КонецФункции	

&НаКлиенте
Процедура СчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
    СсылкаНаДокумент = Элемент.ТекущиеДанные.Ссылка;
	Пар = Новый Структура("Ключ",СсылкаНаДокумент); 
	Форма = ПолучитьФорму("Документ.АР17_СчетНаАренду.Форма.ФормаДокумента",Пар);
    Форма.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура АктыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
    СсылкаНаДокумент = Элемент.ТекущиеДанные.Ссылка;
	Пар = Новый Структура("Ключ",СсылкаНаДокумент); 
	Форма = ПолучитьФорму("Документ.АР17_НачислениеАренднойПлаты.Форма.ФормаДокумента",Пар);
    Форма.Открыть();
	
КонецПроцедуры

// период
&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	АР_ОбщиеПроцедурыКлиент.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	// + NAI Becar Конюшок С.Н. от 21.07.2017 10:46 
	//ВыборПериодаКлиент.ПериодАвтоПодбор(
	//	Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
	//	Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	СтандартнаяОбработка = Ложь;
	ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	Текст = Период;
	ЗаполнитьДоговора();
	// - NAI Becar Конюшок С.Н. 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, ВидПериода, Период, НачалоПериода, КонецПериода) Экспорт
	
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = ВыборПериодаКлиентСервер.НачалоПериодаОтчета(ВидПериода, ТекущаяДата());
	КонецЕсли;
	
	ВыбранныйПериод      = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода);
	СтандартнаяОбработка = Ложь;
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранныйПериод.Представление;
	
	НачалоПериода = ВыбранныйПериод.Значение;
	КонецПериода  = КонецМесяца(ВыбранныйПериод.Значение);

	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода)
	
	Список = ВыборПериодаКлиентСервер.ПолучитьСписокПериодов(НачалоПериода, ВидПериода);
	Если Список.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементСписка = Список.НайтиПоЗначению(НачалоПериода);
	ВыбранныйПериод = Форма.ВыбратьИзСписка(Список, Элемент, ЭлементСписка);
	
	Если ВыбранныйПериод = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список.Индекс(ВыбранныйПериод);
	Если Индекс = 0 ИЛИ Индекс = Список.Количество() - 1 тогда
		ВыбранныйПериод = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, ВыбранныйПериод.Значение);
	КонецЕсли;
	
	Возврат ВыбранныйПериод;
	
КонецФункции

&НаКлиенте
Процедура ВыборОрганизацияПриИзменении(Элемент)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	ДанныеСохранения = Новый Структура();
	ДанныеСохранения.Вставить("Организация", Объект.Организация);
	ДанныеСохранения.Вставить("ИК", Объект.ИК);
	ДанныеСохранения.Вставить("Период", Период);
	ДанныеСохранения.Вставить("ВидПериода", Объект.ВидПериода);
	ДанныеСохранения.Вставить("НачалоПериода", Объект.НачалоПериода);
	ДанныеСохранения.Вставить("ОкончаниеПериода", Объект.ОкончаниеПериода);
	
	//СохранитьЗначение("АР_ЖурналНачислений", Структура);
	ХранилищеОбщихНастроек.Сохранить("Обработка.АР17_ЖурналНачислений.Форма", "ДанныеСохранения", ДанныеСохранения);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Настройки = ХранилищеОбщихНастроек.Загрузить("Обработка.АР17_ЖурналНачислений.Форма", "ДанныеСохранения");
    Если Не Настройки = Неопределено И ТипЗнч(Настройки) = Тип("Структура") Тогда
		
		Объект.Организация = Настройки.Организация;
		Объект.ИК = Настройки.ИК;
		Период = Настройки.Период;
		Объект.ВидПериода = Настройки.ВидПериода;
		Объект.НачалоПериода = Настройки.НачалоПериода;
		Объект.ОкончаниеПериода = Настройки.ОкончаниеПериода;
        
	КонецЕсли;
	ЗаполнитьДоговора();
	
КонецПроцедуры

//////////////////////////////////////////////
&НаКлиенте
Процедура СформироватьСчета(Команда)
	
	Пар = Новый Структура;
	// + NAI Becar Конюшок С.Н. от 27.12.2016 14:21 
	Пар.Вставить("Ссылка", Элементы.Договора.ТекущиеДанные.Договор);
	//Пар.Вставить("Ссылка", Элементы.Счета.ТекущиеДанные.Ссылка);   + NAI Becar Конюшок С.Н. от 27.12.2016 14:15 это была ошибка 
	// - NAI Becar Конюшок С.Н. 
	Пар.Вставить("ВидПериода", Объект.ВидПериода);
	Пар.Вставить("НачалоПериода", Объект.НачалоПериода);
	Пар.Вставить("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Пар.Вставить("Период", ЭтаФорма.Период); 
	
	// + NAI Becar Конюшок С.Н. от 23.01.2017 09:43 групповой отбор
	СписокКА = Новый СписокЗначений;
	СписокДоговоровКА = Новый СписокЗначений;
	Для каждого Стр Из Объект.Договора Цикл
		Если Стр.УстановленВыбор Тогда
		    СписокКА.Добавить(Стр.Контрагент);
			СписокДоговоровКА.Добавить(ПолучитьДоговор(Стр.Договор));
		КонецЕсли; 
	КонецЦикла;
	
	Если СписокКА.Количество() > 1 Тогда
		Пар.Вставить("СписокКА", СписокКА);
		Пар.Вставить("СписокДоговоровКА", СписокДоговоровКА);
	КонецЕсли; 
	// - NAI Becar Конюшок С.Н. 
	
	форма = ПолучитьФорму("Обработка.АР17_ГрупповоеВыставлениеСчетов.Форма.Форма",Пар);
	Если форма.Открыта() Тогда
		Форма.Закрыть();
		форма = ПолучитьФорму("Обработка.АР17_ГрупповоеВыставлениеСчетов.Форма.Форма",Пар);
	КонецЕсли;
	форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура СформироватьАкты(Команда)
	
	Пар = Новый Структура;
	// + NAI Becar Конюшок С.Н. от 19.01.2017 11:34 
	//Пар.Вставить("Ссылка", Элементы.Акты.ТекущиеДанные.Ссылка);
	Пар.Вставить("Ссылка", Элементы.Договора.ТекущиеДанные.Договор);
    // - NAI Becar Конюшок С.Н. 
	Пар.Вставить("ВидПериода", Объект.ВидПериода);
	Пар.Вставить("НачалоПериода", Объект.НачалоПериода);
	Пар.Вставить("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Пар.Вставить("Период", ЭтаФорма.Период);
	
	// + NAI Becar Конюшок С.Н. от 23.01.2017 09:43 групповой отбор
	СписокКА = Новый СписокЗначений;
	СписокДоговоровКА = Новый СписокЗначений;
	СписокИК = Новый СписокЗначений;
	Для каждого Стр Из Объект.Договора Цикл
		Если Стр.УстановленВыбор Тогда
			СписокКА.Добавить(Стр.Контрагент);
			СписокДоговоровКА.Добавить(ПолучитьДоговор(Стр.Договор));
			СписокИК.Добавить(ПолучитьИК(Стр.Договор));
		КонецЕсли; 
	КонецЦикла;
	
	Если СписокКА.Количество() > 1 Тогда
		Пар.Вставить("СписокКА", СписокКА);
		Пар.Вставить("СписокДоговоровКА", СписокДоговоровКА);
		СписокИК = СвернутьСЗ(СписокИК);
		Пар.Вставить("СписокИК", СписокИК);
	КонецЕсли; 
	// - NAI Becar Конюшок С.Н.
	
	форма = ПолучитьФорму("Обработка.АР17_ГрупповоеНачислениеАренднойПлаты.Форма.Форма",Пар);
	Если форма.Открыта() Тогда
		Форма.Закрыть();
		форма = ПолучитьФорму("Обработка.АР17_ГрупповоеНачислениеАренднойПлаты.Форма.Форма",Пар);
	КонецЕсли;
	форма.Открыть();
	
КонецПроцедуры

Функция СвернутьСЗ(сзИсходная)
    
    сзСвернуто = Новый СписокЗначений;
    
    Для Каждого эл_сзИсходная Из сзИсходная Цикл
        Если сзСвернуто.НайтиПоЗначению(эл_сзИсходная.Значение) = Неопределено Тогда
            сзСвернуто.Добавить(эл_сзИсходная.Значение, эл_сзИсходная.Представление);
        КонецЕсли;
    КонецЦикла;
    
    Возврат сзСвернуто;
    
КонецФункции

Функция ПолучитьИК(Договор)
	Возврат Договор.ИК;
КонецФункции	

&НаКлиенте
Процедура УстановитьФлажок(Команда)
	
	Для каждого Стр Из Объект.Договора Цикл
		  Стр.УстановленВыбор = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажок(Команда)
	
	Для каждого Стр Из Объект.Договора Цикл
		Стр.УстановленВыбор = Ложь;
	КонецЦикла;
	
КонецПроцедуры


// + NAI Becar Конюшок С.Н. от 24.01.2017 10:45
&НаСервере   
Функция ПолучитьДоговор(Договор)
	Возврат Договор.ДоговорКонтрагента;
КонецФункции


&НаКлиенте
Процедура ВыборИмущественныйКомплексПриИзменении(Элемент)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидДоговораПриИзменении(Элемент)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ВыборИмущественныйКомплексНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора1 = Новый Массив;//(Элемент.ПараметрыВыбора);
	НовыйПараметр = Новый ПараметрВыбора("ТипОбъекта", ПредопределенноеЗначение("Справочник.АР_ТипыОбъектовАренды.ИмущественныйКомплекс"));
	ПараметрыВыбора1.Очистить();
	ПараметрыВыбора1.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора1);
	
КонецПроцедуры

//
